examples/render_all_grammars/dot/tests_functional_test_import_importoverride_firs.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


34869144 -> 34477400[arrowtail=diamond, dir=both, headlabel="first 1..*"]
34869144 -> 34668472[arrowtail=diamond, dir=both, headlabel="third 1..*"]
34869144[ label="{First|}"]

34668472[ label="{Third|+chain:STRING\l}"]

35708616[ label="{ID|}"]

35714312[ label="{STRING|}"]

35719848[ label="{BOOL|}"]

35725384[ label="{INT|}"]

35730920[ label="{FLOAT|}"]

35736456[ label="{STRICTFLOAT|}"]

35741992[ label="{NUMBER|}"]
35741992 -> 35736456 [dir=back]
35741992 -> 35725384 [dir=back]

35747528[ label="{BASETYPE|}"]
35747528 -> 35741992 [dir=back]
35747528 -> 35730920 [dir=back]
35747528 -> 35719848 [dir=back]
35747528 -> 35708616 [dir=back]
35747528 -> 35714312 [dir=back]

35288680[ label="{*OBJECT|}"]
35288680 -> 35747528 [dir=back]

34477400 -> 34786104[arrowtail=diamond, dir=both, headlabel="second 1..*"]
34477400[ label="{Second|}"]

34786104[ label="{Third|+t:INT\l}"]


}
