examples/render_all_grammars/pu/tests_functional_test_import_importoverride_firs.pu
@startuml
set namespaceSeparator .


class first.First  {
}


class first.Third  {
  STRING chain
}


class ID <<match>> {
}


class STRING <<match>> {
}


class BOOL <<match>> {
}


class INT <<match>> {
}


class FLOAT <<match>> {
}


class STRICTFLOAT <<match>> {
}


class NUMBER <<match>> {
}


class BASETYPE <<match>> {
}


class OBJECT <<abstract>> {
}


class second.Second  {
}


class relative.third.Third  {
  INT t
}


first.First *-- "1..*" second.Second
first.First *-- "1..*" first.Third
NUMBER <|-- STRICTFLOAT
NUMBER <|-- INT
BASETYPE <|-- NUMBER
BASETYPE <|-- FLOAT
BASETYPE <|-- BOOL
BASETYPE <|-- ID
BASETYPE <|-- STRING
OBJECT <|-- BASETYPE
second.Second *-- "1..*" relative.third.Third
@enduml
